       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBDDB2.
       DATA DIVISION.
         WORKING-STORAGE SECTION.

         01  WS-SQLREAD           PIC X(1).
<<<<<<< HEAD
      *** IKAN DEMO config *** 
=======
      *** IKAN DEMO Config *** 
>>>>>>> 48ec552e25f7b42d6ef6904796f8d6097f80e476
      *** INCLUDING SQLCA COPYBOOK ******
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

       PROCEDURE DIVISION.
       MAIN-PARA.

           EXEC SQL
                SELECT IBMREQD INTO: WS-SQLREAD
                FROM SYSIBM.SYSDUMMY1
           END-EXEC.
           Display 'Testing the cobDdb2'.

           STOP RUN.
